app/controllers/mybooks_controller.rb

SELECT `mybooks`.* FROM `mybooks`
---
  def index
    @mybooks = Mybook.all

SELECT "mybooks".* FROM "mybooks" WHERE "mybooks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @mybook = Mybook.find(params[:id])

INSERT INTO `mybooks` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('before step into kernel', '2013-03-15 03:53:59', 'ldd', 'linux device driver', '2013-03-15 03:53:59')
---
  def create
    @mybook = Mybook.new(params[:mybook])

    respond_to do |format|
      if @mybook.save